qinyunti/py32f403-nes/proj/PY32F403_HAL_Driver/Src/py32f403_hal.c
  return status;
}

/**
  * @brief Return tick frequency.
  * @retval tick period in Hz
  */
HAL_TickFreqTypeDef HAL_GetTickFreq(void)
{
  return uwTickFreq;
}

/**
  * @brief This function provides minimum delay (in milliseconds) based
  *        on variable incremented.
  * @note In the default implementation , SysTick timer is the source of time base.
  *       It is used to generate interrupts at regular time intervals where uwTick
  *       is incremented.
  * @note This function is declared as __weak to be overwritten in case of other
  *       implementations in user file.
  * @param Delay specifies the delay time length, in milliseconds.
  * @retval None
  */
__weak void HAL_Delay(uint32_t Delay)
{
  uint32_t tickstart = HAL_GetTick();
  uint32_t wait = Delay;

  /* Add a freq to guarantee minimum wait */
  if (wait < HAL_MAX_DELAY)
  {
    wait += (uint32_t)(uwTickFreq);
  }

  while ((HAL_GetTick() - tickstart) < wait)
  {
  }
}

/**
  * @brief Suspend Tick increment.
  * @note In the default implementation , SysTick timer is the source of time base. It is
  *       used to generate interrupts at regular time intervals. Once HAL_SuspendTick()
  *       is called, the SysTick interrupt will be disabled and so Tick increment
  *       is suspended.
  * @note This function is declared as __weak to be overwritten in case of other
  *       implementations in user file.
  * @retval None
  */
__weak void HAL_SuspendTick(void)
{
  /* Disable SysTick Interrupt */
  CLEAR_BIT(SysTick->CTRL, SysTick_CTRL_TICKINT_Msk);
}

/**
  * @brief Resume Tick increment.
  * @note In the default implementation , SysTick timer is the source of time base. It is
  *       used to generate interrupts at regular time intervals. Once HAL_ResumeTick()
  *       is called, the SysTick interrupt will be enabled and so Tick increment
  *       is resumed.
  * @note This function is declared as __weak to be overwritten in case of other
  *       implementations in user file.
  * @retval None
  */
__weak void HAL_ResumeTick(void)
{
  /* Enable SysTick Interrupt */
  SET_BIT(SysTick->CTRL, SysTick_CTRL_TICKINT_Msk);
}

/**
  * @brief  Returns the HAL revision
  * @retval version 0xXYZR (8bits for each decimal, R for RC)
  */
uint32_t HAL_GetHalVersion(void)
{
  return __PY32F403_HAL_VERSION;
}

/**
  * @brief Returns the device revision identifier.
  * Note: On devices PY32F403
  *       Debug registers DBGMCU_IDCODE and DBGMCU_CR are accessible only in
  *       debug mode (not accessible by the user software in normal mode).
  *       Refer to errata sheet of these devices for more details.
  * @retval Device revision identifier
  */
uint32_t HAL_GetREVID(void)
{
  return ((DBGMCU->IDCODE) >> DBGMCU_IDCODE_REV_ID_Pos);
}

/**
  * @brief  Returns the device identifier.
  * Note: On devices PY32F403
  *       Debug registers DBGMCU_IDCODE and DBGMCU_CR are accessible only in
  *       debug mode (not accessible by the user software in normal mode).
  *       Refer to errata sheet of these devices for more details.
  * @retval Device identifier
  */
uint32_t HAL_GetDEVID(void)
{
  return ((DBGMCU->IDCODE) & IDCODE_DEVID_MASK);
}

/**
  * @brief  Returns first word of the unique device identifier (UID based on 96 bits)
  * @retval Device identifier
  */
uint32_t HAL_GetUIDw0(void)
{
   return(READ_REG(*((uint32_t *)UID_BASE)));
}

/**
  * @brief  Returns second word of the unique device identifier (UID based on 96 bits)
  * @retval Device identifier
  */
uint32_t HAL_GetUIDw1(void)
{
   return(READ_REG(*((uint32_t *)(UID_BASE + 4U))));
}

/**
  * @brief  Returns third word of the unique device identifier (UID based on 96 bits)
  * @retval Device identifier
  */
uint32_t HAL_GetUIDw2(void)
{
   return(READ_REG(*((uint32_t *)(UID_BASE + 8U))));
}

/**
  * @brief  Enable the Debug Module during SLEEP mode
  * @retval None
  */
void HAL_DBGMCU_EnableDBGSleepMode(void)
{
  SET_BIT(DBGMCU->CR, DBGMCU_CR_DBG_SLEEP);
}

/**
  * @brief  Disable the Debug Module during SLEEP mode
  * @retval None
  */
void HAL_DBGMCU_DisableDBGSleepMode(void)
{
  CLEAR_BIT(DBGMCU->CR, DBGMCU_CR_DBG_SLEEP);
}

/**
  * @brief  Enable the Debug Module during STOP mode
  * @retval None
  */
void HAL_DBGMCU_EnableDBGStopMode(void)
{
  SET_BIT(DBGMCU->CR, DBGMCU_CR_DBG_STOP);
}

/**
  * @brief  Disable the Debug Module during STOP mode
  * @retval None
  */
void HAL_DBGMCU_DisableDBGStopMode(void)
{
  CLEAR_BIT(DBGMCU->CR, DBGMCU_CR_DBG_STOP);
}

/**
  * @brief  Enable the Debug Module during STANDBY mode
  * @retval None
  */
void HAL_DBGMCU_EnableDBGStandbyMode(void)
{
  SET_BIT(DBGMCU->CR, DBGMCU_CR_DBG_STDBY);
}

/**
  * @brief  Disable the Debug Module during STANDBY mode
  * @retval None
  */
void HAL_DBGMCU_DisableDBGStandbyMode(void)
{
  CLEAR_BIT(DBGMCU->CR, DBGMCU_CR_DBG_STDBY);
}

/**
  * @brief  Set Trace pin assignment control
  * @param  PinAssignment This parameter can be one of the following values:
  *         @arg @ref HAL_DBGMCU_TRACE_NONE
  *         @arg @ref HAL_DBGMCU_TRACE_ASYNCH
  *         @arg @ref HAL_DBGMCU_TRACE_SYNCH_SIZE1
  *         @arg @ref HAL_DBGMCU_TRACE_SYNCH_SIZE2
  *         @arg @ref HAL_DBGMCU_TRACE_SYNCH_SIZE4
  * @retval None
  */
void HAL_DBGMCU_SetTracePinAssignment(uint32_t PinAssignment)
{
  /* Check the parameters */
  assert_param(IS_DBGMCU_TracePinAssignment(PinAssignment));
  MODIFY_REG(DBGMCU->CR, DBGMCU_CR_TRACE_IOEN | DBGMCU_CR_TRACE_MODE, PinAssignment);
}

/**
  * @brief  Get Trace pin assignment control
  * @retval  PinAssignment This parameter can be one of the following values:
  *         @arg @ref HAL_DBGMCU_TRACE_NONE
  *         @arg @ref HAL_DBGMCU_TRACE_ASYNCH
  *         @arg @ref HAL_DBGMCU_TRACE_SYNCH_SIZE1
  *         @arg @ref HAL_DBGMCU_TRACE_SYNCH_SIZE2
  *         @arg @ref HAL_DBGMCU_TRACE_SYNCH_SIZE4
  */
uint32_t HAL_DBGMCU_GetTracePinAssignment()
{
  return (READ_BIT(DBGMCU->CR, DBGMCU_CR_TRACE_IOEN | DBGMCU_CR_TRACE_MODE));
}

/**
  * @brief  Set memory mapping at address 0x00000000
  * @param  Memory This parameter can be one of the following values:
  *         @arg @ref SYSCFG_BOOT_MAINFLASH
  *         @arg @ref SYSCFG_BOOT_SYSTEMFLASH
  *         @arg @ref SYSCFG_BOOT_ESMC
  *         @arg @ref SYSCFG_BOOT_SRAM
  * @retval None
  */
void HAL_SYSCFG_SetRemapMemory(uint32_t Memory)
{
  MODIFY_REG(SYSCFG->CFGR[0], SYSCFG_CFGR1_MEM_MODE, Memory);
}

/**
  * @brief  Get memory mapping at address 0x00000000
  * @retval Returned value can be one of the following values:
  *         @arg @ref SYSCFG_BOOT_MAINFLASH
  *         @arg @ref SYSCFG_BOOT_SYSTEMFLASH
  *         @arg @ref SYSCFG_BOOT_ESMC
  *         @arg @ref SYSCFG_BOOT_SRAM
  */
uint32_t HAL_SYSCFG_GetRemapMemory(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->CFGR[0], SYSCFG_CFGR1_MEM_MODE));
}

/**
  * @brief  Enable GPIO Analog Mode
  * @note   Depending on devices and packages, some IOs may not be available.
  *         Refer to device datasheet for IOs availability.
  * @param  GPIOAnalogEnable This parameter can be a combination of the following values:
  *         @arg @ref HAL_SYSCFG_GPIO_ENA_PA0
  *         @arg @ref HAL_SYSCFG_GPIO_ENA_PA1
  *         @arg @ref HAL_SYSCFG_GPIO_ENA_PA2
  *         @arg @ref HAL_SYSCFG_GPIO_ENA_PA3
  *         @arg @ref HAL_SYSCFG_GPIO_ENA_PA4
  *         @arg @ref HAL_SYSCFG_GPIO_ENA_PA5
  *         @arg @ref HAL_SYSCFG_GPIO_ENA_PA6
  *         @arg @ref HAL_SYSCFG_GPIO_ENA_PA7
  *         @arg @ref HAL_SYSCFG_GPIO_ENA_PB0
  *         @arg @ref HAL_SYSCFG_GPIO_ENA_PB1
  *         @arg @ref HAL_SYSCFG_GPIO_ENA_PC0
  *         @arg @ref HAL_SYSCFG_GPIO_ENA_PC1
  *         @arg @ref HAL_SYSCFG_GPIO_ENA_PC2
  *         @arg @ref HAL_SYSCFG_GPIO_ENA_PC3
  *         @arg @ref HAL_SYSCFG_GPIO_ENA_PC4
  *         @arg @ref HAL_SYSCFG_GPIO_ENA_PC5
  */
void HAL_SYSCFG_EnableGPIOAnalogMode(uint32_t GPIOAnalogEnable)
{
  /* Check the parameters */
  assert_param(IS_SYSCFG_GPIO_ENA_IO(GPIOAnalogEnable)); 
  SET_BIT(SYSCFG->GPIOENA,GPIOAnalogEnable);
}

/**
  * @brief  Disable GPIO Analog Mode
  * @note   Depending on devices and packages, some IOs may not be available.
  *         Refer to device datasheet for IOs availability.
  * @param  GPIOAnalogEnable This parameter can be a combination of the following values:
  *         @arg @ref HAL_SYSCFG_GPIO_ENA_PA0
  *         @arg @ref HAL_SYSCFG_GPIO_ENA_PA1
  *         @arg @ref HAL_SYSCFG_GPIO_ENA_PA2
  *         @arg @ref HAL_SYSCFG_GPIO_ENA_PA3
  *         @arg @ref HAL_SYSCFG_GPIO_ENA_PA4
  *         @arg @ref HAL_SYSCFG_GPIO_ENA_PA5
  *         @arg @ref HAL_SYSCFG_GPIO_ENA_PA6
  *         @arg @ref HAL_SYSCFG_GPIO_ENA_PA7
  *         @arg @ref HAL_SYSCFG_GPIO_ENA_PB0
  *         @arg @ref HAL_SYSCFG_GPIO_ENA_PB1
  *         @arg @ref HAL_SYSCFG_GPIO_ENA_PC0
  *         @arg @ref HAL_SYSCFG_GPIO_ENA_PC1
  *         @arg @ref HAL_SYSCFG_GPIO_ENA_PC2
  *         @arg @ref HAL_SYSCFG_GPIO_ENA_PC3
  *         @arg @ref HAL_SYSCFG_GPIO_ENA_PC4
  *         @arg @ref HAL_SYSCFG_GPIO_ENA_PC5
  * @retval None
  */
void HAL_SYSCFG_DisableGPIOAnalogMode(uint32_t GPIOAnalogEnable)
{
  /* Check the parameters */
  assert_param(IS_SYSCFG_GPIO_ENA_IO(GPIOAnalogEnable)); 
  CLEAR_BIT(SYSCFG->GPIOENA,GPIOAnalogEnable);
}

/**
  * @brief  Enable analog filter of I2C related IO
  * @note   Depending on devices and packages, some IOs may not be available.
  *         Refer to device datasheet for IOs availability.
  * @param  I2CAnalogFilter This parameter can be a combination of the following values:
  *         @arg @ref HAL_SYSCFG_I2C_ANF_PB5
  *         @arg @ref HAL_SYSCFG_I2C_ANF_PB6
  *         @arg @ref HAL_SYSCFG_I2C_ANF_PB7
  *         @arg @ref HAL_SYSCFG_I2C_ANF_PB8
  *         @arg @ref HAL_SYSCFG_I2C_ANF_PB9
  *         @arg @ref HAL_SYSCFG_I2C_ANF_PB10
  *         @arg @ref HAL_SYSCFG_I2C_ANF_PB11
  *         @arg @ref HAL_SYSCFG_I2C_ANF_PB12
  * @retval None
  */
void HAL_SYSCFG_EnableI2CAnalogFilter(uint32_t I2CAnalogFilter)
{    
  /* Check the parameters */
  assert_param(IS_SYSCFG_I2C_ANF_IO(I2CAnalogFilter));
  SET_BIT(SYSCFG->CFGR[0],I2CAnalogFilter);
}

/**
  * @brief  Disable analog filter of I2C related IO
  * @note   Depending on devices and packages, some IOs may not be available.
  *         Refer to device datasheet for IOs availability.
  * @param  I2CAnalogFilter This parameter can be a combination of the following values:
  *         @arg @ref HAL_SYSCFG_I2C_ANF_PB5
  *         @arg @ref HAL_SYSCFG_I2C_ANF_PB6
  *         @arg @ref HAL_SYSCFG_I2C_ANF_PB7
  *         @arg @ref HAL_SYSCFG_I2C_ANF_PB8
  *         @arg @ref HAL_SYSCFG_I2C_ANF_PB9
  *         @arg @ref HAL_SYSCFG_I2C_ANF_PB10
  *         @arg @ref HAL_SYSCFG_I2C_ANF_PB11
  *         @arg @ref HAL_SYSCFG_I2C_ANF_PB12
  * @retval None
  */
void HAL_SYSCFG_DisableI2CAnalogFilter(uint32_t I2CAnalogFilter)
{
  /* Check the parameters */
  assert_param(IS_SYSCFG_I2C_ANF_IO(I2CAnalogFilter)); 
  CLEAR_BIT(SYSCFG->CFGR[0],I2CAnalogFilter);
}

/**
  * @brief  Enable GPIO Noise Filter
  * @note   Depending on devices and packages, some IOs may not be available.
  *         Refer to device datasheet for IOs availability.
  * @param  GPIOx where x can be (A..E) to select the GPIO peripheral for PY32F4 family
  * @param  GPIO_Pin specifies the pin to be Noise Filter
  *         This parameter can be any combination of GPIO_Pin_x where x can be (0..15).
  * @retval None
  */
void HAL_SYSCFG_EnableGPIONoiseFilter(GPIO_TypeDef *GPIOx,uint16_t GPIO_Pin)
{
  /* Check the parameters */
  assert_param(IS_GPIO_ALL_INSTANCE(GPIOx));
  assert_param(IS_GPIO_PIN(GPIO_Pin));
  if(GPIOx==GPIOA)
  {    
    SET_BIT(SYSCFG->PAENS,GPIO_Pin);
  }
  else if(GPIOx==GPIOB)
  {
    SET_BIT(SYSCFG->PBENS,GPIO_Pin);
  }
  else if(GPIOx==GPIOC)
  {
    SET_BIT(SYSCFG->PCENS,GPIO_Pin);
  }
  else if(GPIOx==GPIOD)
  {
    SET_BIT(SYSCFG->PDENS,GPIO_Pin);
  }
  else if(GPIOx==GPIOE)
  {
    SET_BIT(SYSCFG->PEENS,GPIO_Pin);
  }
  else
  {
    
