qinyunti/py32f403-nes/proj/PY32F403_HAL_Driver/Src/py32f403_hal.c
  }
}

/**
  * @brief  Disable GPIO Noise Filter
  * @note   Depending on devices and packages, some IOs may not be available.
  *         Refer to device datasheet for IOs availability.
  * @param  GPIOx where x can be (A..E) to select the GPIO peripheral for PY32F4 family
  * @param  GPIO_Pin specifies the pin to be Noise Filter
  *         This parameter can be any combination of GPIO_Pin_x where x can be (0..15).
  * @retval None
  */
void HAL_SYSCFG_DisableGPIONoiseFilter(GPIO_TypeDef *GPIOx,uint16_t GPIO_Pin)
{
  /* Check the parameters */
  assert_param(IS_GPIO_ALL_INSTANCE(GPIOx));
  assert_param(IS_GPIO_PIN(GPIO_Pin));
  if(GPIOx==GPIOA)
  {    
    CLEAR_BIT(SYSCFG->PAENS,GPIO_Pin);
  }
  else if(GPIOx==GPIOB)
  {
    CLEAR_BIT(SYSCFG->PBENS,GPIO_Pin);
  }
  else if(GPIOx==GPIOC)
  {
    CLEAR_BIT(SYSCFG->PCENS,GPIO_Pin);
  }
  else if(GPIOx==GPIOD)
  {
    CLEAR_BIT(SYSCFG->PDENS,GPIO_Pin);
  }
  else if(GPIOx==GPIOE)
  {
    CLEAR_BIT(SYSCFG->PEENS,GPIO_Pin);
  }
  else
  {
    
  }
}

/**
  * @brief  Enable the timer clock 2X pclk
  * @note   Depending on devices and packages, some timers may not be available.
  *         Refer to device datasheet for timers availability.
  * @param  TimerSelect This parameter can be a combination of the following values:
  *         @arg @ref HAL_SYSCFG_TIM2_3_4_5_6_7_12_13_14_SEL
  *         @arg @ref HAL_SYSCFG_TIM1_8_9_10_11_SEL
  * @retval None
  */
void HAL_SYSCFG_EnableTimerClock2xPclk(uint32_t TimerSelect)
{    
  /* Check the parameters */
  assert_param(IS_SYSCFG_TIM_CLK_CFG(TimerSelect));
  CLEAR_BIT(SYSCFG->TIM_CLK_EXT,TimerSelect);
}

/**
  * @brief  Disable the timer clock 2X pclk
  * @note   Depending on devices and packages, some timers may not be available.
  *         Refer to device datasheet for timers availability.
  * @param  TimerSelect This parameter can be a combination of the following values:
  *         @arg @ref HAL_SYSCFG_TIM2_3_4_5_6_7_12_13_14_SEL
  *         @arg @ref HAL_SYSCFG_TIM1_8_9_10_11_SEL
  * @retval None
  */
void HAL_SYSCFG_DisableTimerClock2xPclk(uint32_t TimerSelect)
{
  /* Check the parameters */
  assert_param(IS_SYSCFG_TIM_CLK_CFG(TimerSelect)); 
  SET_BIT(SYSCFG->TIM_CLK_EXT,TimerSelect);
}

/**
  * @}
  */

/**
  * @}
  */

#endif /* HAL_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT Puya *****END OF FILE******************/
